#include <iostream>

/*
    Напишете рекурсивна функция `void print(char* str)`, която приема указател към символен низ и го печата на екрана.
    Напишете и рекурсивна функция `void printRev(char* str)`, която приема указател към символен низ и го печата на екрана наобратно.
*/

void print(char *str)
{
    // За празния низ няма какво да отпечатваме
    if (*str == 0)
        return;

    // Отпечатваме първия елемент
    std::cout << *str;

    // И след това отпечатваме всичко останало
    print(str + 1);
}

void printRev(char *str)
{
    // За празния низ няма какво да отпечатваме
    if (*str == 0)
        return;

    // Отпечатваме всичко след първия символ наобратно
    printRev(str + 1);

    // Отпечатваме и първия символ след това
    std::cout << *str;
}

int main()
{

    char arr[] = "abcd";

    printRev(arr);

    return 0;
}