#include <iostream>

/*
    Напишете рекурсивна функция, която приема указател към първия и последен елемент на масив от цели числа
    и която връща сумата на елементите в масива.
*/

// Решението е аналогично на това от предната задача с разликата.
int sum(int *start, int *end)
{
    // Терминиращо условие. Сумата на празен масив е 0.
    if (start > end)
        return 0;

    // Сумата на елементите в масива е равна на първия елемент + сумата на останалите елементи
    return *start + sum(start + 1, end);
}

// Познато решение без рекурсия
int sumArr(int arr[], int size)
{
    int sum = 0;

    for (int i = 0; i < size; i++)
        sum += arr[i];

    return sum;
}

int main()
{

    int arr[] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};

    std::cout << sum(arr, arr + 9);

    return 0;
}