#include <iostream>

/*
    Напишете програма, която по въведено положително число проверява дали цифрите на числото са сортирани във възходящ ред.
*/
int main()
{

    int n = 0;
    std::cin >> n;

    // Помощна променлива, която ще ползваме, за да знаем дали след края на изпълнението на цикъла
    // въведеното число е сортирано. Можем ли да решим задачата без тази променлива?
    bool sorted = true;
    // Помощна променлива, която ще ползваме на всяка итерация на цикъла, за да сравняваме текущата
    // цифра на числото с предишната.
    int previousDigit = 10;

    while (n > 0)
    {
        // На всяка стъпка взимаме текущата "последна" цифра на числото.
        int currentDigit = n % 10;
        // Ако тя е по-голяма от предишната, значи числото не е сортирано.
        if (currentDigit > previousDigit)
        {
            sorted = false;
            break; // няма нужда да изпълняваме повече цикъла, затова използваме break и го прекратяваме
        }
        // Обновяваме стойността на previousDigit, за да я ползваме при следващата итерация и сравнение
        previousDigit = currentDigit;
        // "Режем" последната цифра на числото
        n /= 10;
    }

    if (sorted)
        std::cout << "sorted" << std::endl;
    else
        std::cout << "not sorted" << std::endl;

    return 0;
}