#include <iostream>

/*
    Да се напише програма, която намира сумата на произволни въведени от потребителя n числа, 
    където n е естествено число въведено от потребителя.
*/
int main()
{

    int n = 1, sum = 0;
    std::cin >> n;

    // Изпълняваме цикъла n пъти. Стойността на контролната променлива реално не ни е нужна.
    for (int i = 0; i < n; i++)
    {   
        // На всяка итерация четем от стандартния вход.
        int number = 0;
        std::cin >> number;
        sum += number;
    }

    std::cout << sum << std::endl;

    return 0;
}