#include <iostream>

/*
    Напишете функция, която приема матрица NxМ (N,М<=100) и две цели числа i и j и която разменя ред i с ред j.
*/

// С тази функция виждаме това което видяхме и при масиви. Матрицата не се копира, когато се подава като параметър на функция.
// Затова можем да имаме функции, които променят стойностите записани в матрицата.
void swapRows(int matrix[100][100], int rows, int cols, int i, int j)
{
    // Проверка за коректност, която пропускахме в предните задачи.
    if (i < 0 || i >= rows || j < 0 || j >= cols)
        return;

    // За ред i, j обхождаме всички елементи и ги разменяме
    for (int x = 0; x < cols; x++)
    {
        int tmp = matrix[i][x];
        matrix[i][x] = matrix[j][x];
        matrix[j][x] = tmp;
    }
}

int main()
{
    int matrix[100][100] = {{3, 2, 3},
                            {4, 5, 6},
                            {7, 8, 7}};

    swapRows(matrix, 3, 3, 0, 2);
    // След изпълнението на swapRows матрицата ни ще бъде променена.

    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            std::cout << "matrix[" << i << "][" << j << "]: " << matrix[i][j] << " ";
        }
        std::cout << std::endl;
    }

    return 0;
}