#include <iostream>

/*
    Да се напиша програма, която кара потребителя да въведе от клавиатурата матрица NxN и после тази матрица да се отпечата по четим начин на екрана.
*/

int main()
{
    // Дефинираме матрицата с нейния максимален размер 100x100
    int matrix[100][100];
    // След това въвеждаме реалните й измерения - също както правихме и с масивите.
    // Добре е да не забравяме, че е хубаво да се направи една проверка за коректност на входа.
    int n, m;
    std::cin >> n >> m;

    // Класическата конструкция с вложен цикъл за обхождане на всеки елемент на матрицата.
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            std::cout << "Input matrix[" << i << "][" << j << "]: " << std::endl;
            // Въвеждаме от клавиатурата елемента на ред i, колона j
            std::cin >> matrix[i][j];
        }
    }

    // Съшото като предното с разликата, че тук отпечваме елементите на екрана.
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            std::cout << "matrix[" << i << "][" << j << "]: " << matrix[i][j] << " ";
        }
        // След като сме отпечатали на екрана елементите на текущия ред, отпечатваме и един нов ред.
        std::cout << std::endl;
    }

    // Пример за обхождане на един конкретен ред.
    // Виждате, че едното измерение е фиксирано и имаме само един цикъл, който върви по другото измерение.
    std::cout << "The second row is: " << std::endl;
    for (int i = 0; i < n; i++)
    {
        std::cout << matrix[1][i] << " ";
    }

    return 0;
}