#include <iostream>

/*
    Напишете функция, която приема матрица NхN (N<=100) и връща сумата на елементите й.
*/

// Сигнатурата на функция, която приема матрица, често ще изглежда по този начин.
// Подаваме самата матрица и размерите на двете й измерения.
// Също като при масивите, можем да не специфицираме първото измерение на матрицата, защото компилаторът не прави нищо с него.
// Размерът на второто измерение обаче е задължително да се подаде, за да знае компилаторът къде да търси елементите на ред i - повече за това в следващата задача.
int sumOfElements(int matrix[][100], int rows, int cols)
{
    int sum = 0;

    // Обхождаме матрицата по познатия вече начин.
    for (int i = 0; i < rows; i++)
    {
        for (int j = 0; j < cols; j++)
        {
            // Всеки елемент го добавяме към акумулираща променлива sum
            sum += matrix[i][j];
        }
    }

    return sum;
}

int main()
{
    int matrix2[100][100] = {
        {1, 2, 3},
        {1, 2, 4},
        {5, 2, 4}};

    std::cout << "The sum of the matrix is: " << sumOfElements(matrix2, 3, 3) << std::endl;

    return 0;
}