// Това е коментар. Неговата задача е да разяснява
// неща на хората, които четат кода. Програмата се изпълнява
// от компютъра, но се чете и пише от хора.
// Компилаторът игнорира коментарите 
// и затова след тези символи '//' на същия ред 
// можем да напишем, каквото искаме.

/*
	Понякога коментарът може да се простира на няколко реда
    Всичко между тези две "огради" също не 
	играе никаква роля в програмата освен за информация
	на този, който чете кода.
*/


// Добавяме iostream header-а. Той включва cin и cout
// в себе си, които ползваме за да пише на стандартния изход
// и да четем от стандартния вход.
#include <iostream>


/*
    'int main()' е парче код, което
	ще виждате много често. Всяка програма, която искаме
    да изпълним трябва да има main функция и изпълнението
    на програмата започва ред по ред в тялото на тази
    функция.
*/
int main() {

    int a = 5; // дефинираме променлива от тип int и й даваме стойност 5
    int b = 10; // дефинираме променлива от тип int и й даваме стойност 5

    double pi = 3.14; // дефинираме променлива от тип double и й даваме стойност 3.14

    bool bb = false; // дефинираме променлива от тип bool и й даваме стойност false
    bool c = true; // дефинираме променлива от тип bool и й даваме стойност true

    char sym = 'A'; // дефинираме променлива от тип char и й даваме стойност A

    int x; // дефинираме променлива от тип int 
    int y; // дефинираме променлива от тип int 

    // cin(character input stream) е обект, който репрезентира стандартния вход(standard input stream).
    // Използваме го, за да пишем програми, с които можем да взаимодействаме.

    std::cin >> x >> y; // Четем от стандартния вход и записваме стойността в x и в y
    
    int p = x * y; // дефинираме променлива от тип int и й даваме стойност резултата от изпълненито на операцията умножение на променливите x и y

    bool expr = p > 30; // дефинираме променлива от тип bool и й даваме стойност резултата от изпълненито на логическата операцията >


    // Условен оператор if else
    if(expr) { // приема израз, който може да се оцени до bool стойност(true vs false)
        // Ако стойността на израза е true, се изпълнява блокът код след if
        std::cout << "Greater than 30!";
    } else {
        // Ако стойността на израза е false, се изпълнява блокът код след else
        std::cout << "Less than 30!";
    }
    
    // функцията приключва с ключовата дума return
    return 0;
}