#include <iostream>

int main()
{   
    // Матрица с 3 реда и 4 колони
    int x[3][4] = {
        {0, 1, 2, 3},
        {4, 5, 6, 7},
        {8, 9, 10, 11}};

    // Достъпваме елемента на втори ред, трета колона - индексирането започва от 0!
    std::cout << x[1][2] << std::endl;

    // Нормалните масиви обхождаме с един цикъл по единственото им измерение
    int y[3] = {4, 2, -5};
    for (int i = 0; i < 3; i++)
    {
        std::cout << y[i];
    }

    // Двумерните масиви обхождаме с вложени цикли по двете им измерения.
    for (int i = 0; i < 3; i++)
    {   
        // За всеки ред i обхождаме елементите му по всяка колона
        for (int j = 0; j < 4; j++)
        {
            std::cout << x[i][j] << " ";
        }

        std::cout << std::endl;
    }

    return 0;
}