#include <iostream>

/*
    Напишете програма, която при въведен числов масив с размер n (0 <= n <= 20) извежда на екрана всички числа, които са четни.
*/
bool isEven(int x)
{
    return x % 2 == 0;
}

int main()
{

    // Познатият начин(от първа задача) за въвеждане на елементите на масив.
    // Пропускаме проверката за коректност, но не защото я подценяваме,
    // а само защото искаме да се фокусираме на "съществената" част от задачата.
    // Генерално е важно нашите програми да са коректни.
    int n;
    std::cin >> n;
    int arr[20];

    for (int i = 0; i < n; i++)
        std::cin >> arr[i];

    // Често ще се виждаме подобна конструкция - обхождаме елементите на масива и
    // правим нещо само за тези които отговарят на някакво условие.
    for (int i = 0; i < n; i++)
    {
        if (isEven(arr[i]))
        {
            std::cout << arr[i] << " ";
        }
    }

    return 0;
}