#include <iostream>

/*
    Напишете програма, която при въведен числов масив с размер n (0 <= n <= 20) извежда на екрана всички числа, но в обратен ред.
*/
int main()
{

    int n;
    std::cin >> n;
    int arr[20];

    for (int i = 0; i < n; i++)
        std::cin >> arr[i];

    // Обхождане отзад напред. Индексът ни почва от последния елемент
    // и на всяка итерация намалява, докато не падне под нулата.
    for (int i = n - 1; i >= 0; i--)
    {
        std::cout << arr[i] << " ";
    }

    return 0;
}