#include <iostream>

/*
    Да се направи програма, която създава масив с n<=20 елемента, които се въвеждат от клавиатурата.
    Програмата да печата на екрана произведението на елементите.
*/
int main()
{

    int n;
    std::cin >> n;
    int arr[20];

    // Отново проверка за коректност, но в малко по-различен вид.
    // Ако входът е невалиден, директно приключваме изпълнението на main функцията
    // с помощта на ключовата функция return. main функцията е като всяка друга функция
    // и можем да имаме повече от едно място на приключване.
    if (n <= 0 || n > 20)
    {
        std::cout << "Invaild innput size: " << n << ". The size must be in the range [0, 20]." << std::endl;
        return -1;
    }

    for (int i = 0; i < n; i++)
        std::cin >> arr[i];

    // Използваме тип long long, защото произведението може да стане голямо и да надхвърли диапазона на int.
    long long product = 1;
    for (int i = 0; i < n; i++)
        product *= arr[i];

    std::cout << product << std::endl;

    return 0;
}