#include <iostream>

/*
    Напишете програма, която отпечатва всички комбинации на числа от 1 до `n`, които имат сума `n`.
*/

// Помощна функция, която отпечатва изградена комбинация от числа
void printCombination(int out[], int size)
{
    for (int i = 0; i < size; i++)
    {
        std::cout << out[i] << " ";
    }
    std::cout << std::endl;
}

// Функция, която отпечатва всички комбинации на числа от i до n, които имат сума n.
// В out ще пазим текущо иградената комбинация.
void printCombinations(int i, int n, int out[], int size)
{
    // Ако сумата, която искаме да достигнем е 0, значи няма как да добавяме повече числа
    // и отпечатваме текущата комбинация.
    if (n == 0)
    {
        printCombination(out, size);
    }

    // Обхождаме всяко едно от числата от i до n, добавяме го в комбинацията
    // и пробваме да допълним оставащата сума.
    for (int j = i; j <= n; j++)
    {
        // Добавяме текущото число
        out[size++] = j;

        // Намираме какви други числа трябва да добавим, за да стигнм до новата сума
        printCombinations(j, n - j, out, size);

        // Backtracking! - премахваме текущото число
        size--;
    }
}

int main()
{
    int n = 5;
    int out[5];

    printCombinations(1, n, out, 0);
}