#include <iostream>
#include <fstream>

/*
    Напишете програма, която чете ред по ред от стандартния вход до въвеждане на празен ред и записва всеки ред в текстов файл.
    Приемете, че всеки ред е до 1024 символа.
*/

int main()
{
    std::ofstream file;

    file.open("output.txt"); // Oтваряме файла

    char line[1024];
    std::cin.getline(line, 1024); // Четем от стандартния вход първия ред

    while (strlen(line) > 0) // Докато не сме въвели празен ред
    {
        file << line << std::endl;    // Пишем във файла по абсолютно същия начин, по който бихме писали на стандартния изход
        std::cin.getline(line, 1024); // Четем от стандартния вход следващия ред
    }

    file.close(); // Затваряме файла

    return 0;
}