#include <iostream>
/*
    Напишете функция `int primeNumbers(int n)`, която връща броя на простите числа от 1 до n.
*/


/*
    Разделяме задачата на два подпроблема:
    
    1) Проверка дали дадено число е просто
    2) Обхождане на числата и намиране на бройката на простите
*/


// Просто число е такова което се дели само на 1 и на себе си.
// Това е равносилно на това да има два делителя.
bool isPrime(int n)
{
    int dividers = 0;
    
    // Обхождаме всички по-малки числа и броим делителите
    for(int i = 1; i <= n; i++)
    {
        if (n % i == 0)
            dividers++;
    }

    // Ако делителите са два, числото е просто, а в противен случай не е.
    return dividers == 2;

}

// Вече имаме функция, която проверява дали число е просто.
// Ползваме я директно, за да преброим броя на простите числа от 1 до n.
int primeNumbers(int n)
{   
    int counter = 0;
    for(int i = 2; i < n; i++)
    {
        if (isPrime(i))
            counter++;
    }

    return counter;
}


int main()
{   
    // 2, 3, 5, 7, 11, 13, 17, 19
    std::cout << primeNumbers(20) << std::endl;
}