#include <iostream>

/*
    Напишете функция `int* createArray(int size)` , която създава динамичен масив с размер `size` и която кара потребителя да въведе елементите на масива.
    Функцията да връща указател към началото на новосъздадения масив. Използвайте функцията в `main` функцията и след това се погрижете да почистите заделената памет.
*/

int *createArray(int size)
{
    // Заделяме size на брой елементи в паметта
    int *arr = new int[size];

    // Въвеждаме ги от клавиатурата
    for (int i = 0; i < size; i++)
        std::cin >> arr[i];

    // Връщаме указателя към първият елемент. Паметта, която сме заделили, няма да бъде зачистена след изпълнението на фунцкията
    return arr;
}

int main()
{
    int n;
    std::cin >> n;

    int *arr = createArray(n);

    for (int i = 0; i < n; i++)
        std::cout << arr[i] << " ";

    // Все пак, в някакъв момент трябва да освободим паметта, заделена от функцията createArray
    delete[] arr;

    return 0;
}