#include <iostream>

/*
    Създайте динамичен масив от цели числа с размер N (число, въведено от потребителя).
    Въведете елементите на масива от клавиатурата, отпечатайте ги и после се погрижете за почистването на паметта.
*/
int main()
{
    int n;
    std::cin >> n;

    // Заделяме точно n на брой int-ове в паметта
    int *arr = new int[n];

    // Оттам нататък работим с указателя по-познатия ни вече начин.
    // Единствената разлика е, че паметта, към която сочи, не е на stack-а а е в heap-а
    for (int i = 0; i < n; i++)
        std::cin >> arr[i];

    for (int i = 0; i < n; i++)
        std::cout << arr[i] << " ";

    // Ръчно заделената памет трябва винаги да бъде и ръчно освобедена, когато не ни е нужна вече
    delete[] arr;

    return 0;
}