#include <iostream>

/*
    Напишете функция `void deleteElement(int *arr, int &size, int index)`, която изтрива елемента на позиция `index`.
    Преди приключването трябва да се намали размерът на масива.
*/

// За да решим тази задача, ще мислим по малко по-различен начин за масива.
// Ще го разглеждаме като буфер с максимален и реален размер. Реално няма да
// трием елемента на даден индекс, а ще пренаредим масива и ще му променим реалния
// размер, така че да изглежда сякаш сме изтрили елемент.
void deleteElement(int *arr, int &size, int index)
{
    // проверка за коректност
    if (index < 0 || index >= size)
        return;

    // Вместо да изтрием елемента на позиция index, ще преместим всички елементи след него с една позиция назад.
    for (int i = index; i < size - 1; i++)
    {
        arr[i] = arr[i + 1];
    }

    // Намаляваме реалния размер на масива
    size--;
}

int main()
{

    int arr[] = {1, 2, 3, 4, 5};
    int size = 5;

    deleteElement(arr, size, 3);

    for (int i = 0; i < size; i++)
    {
        std::cout << arr[i] << " ";
    }

    return 0;
}