#include <iostream>

/*
    Да се напише булева функция, която приема матрица NxN (N <= 100), и която връща true, ако матрицата е симетрична.
*/

// Функция, която проверява дали ред i и колона i на една квадратна матрица са еднакви
bool isRowEqualCol(int matrix[100][100], int size, int i)
{
    // Обхождаме всяка клетка на реда и колоната
    for (int j = 0; j < size; j++)
    {
        // Ако срещнем разминаване, значи редът и колоната не са еднакви
        if (matrix[i][j] != matrix[j][i])
        {
            return false;
        }
    }

    // Ако е нямало разминаване за нито една клетка, значи редът и колоната са еднакви
    return true;
}

// Основната функция
bool isSymetric(int matrix[100][100], int size)
{
    // Обхождаме всички редове
    for (int i = 0; i < size; i++)
    {
        // Ако има ред, който не е еднакъв със съответната колона, значи матрицата не е симетрична
        if (!isRowEqualCol(matrix, size, i))
        {
            return false;
        }
    }

    // Ако е нямало разминаване за нито един ред/колона, значи матрицата е симетрична
    return true;
}

int main()
{

    int matrix[100][100] = {
        {0, 5, 9, 3},
        {5, 4, 7, 1},
        {9, 7, 6, 2},
        {3, 1, 2, 4}};

    std::cout << isSymetric(matrix, 4);

    return 0;
}